{
    "about": "Hello, my name is **Jeffrey Ma**. I am a software engineer with strong experience in quantum computing and GPU hardware.\n I recently finished my MS degree in computer science at the University of California, Los Angeles, where I wrote a thesis on block encodings for quantum computing. My undergraduate studies were also at UCLA, where I studied CSE (UCLA's version of EECS). \n\n\n Outside of computer science, my hobbies include bouldering, violin and playing cooperative video games with friends.",
    "passion": "I am highly passionate about high performance computing and have a strong curiosity for different programming paradigms and languages. While quantum computing and parallel processing differ in how computational resources contribute to efficient programs, both fields deal with similar problems with regards to compilation, control software, and GPU/QPU microarchitecture. Furthermore, I believe that both paradigms are necessary for solving the difficult problems of the future. Thus, I wish to gain experience creating optimizing software at a commercial scale. By working with and maintaining high quality software supported by well-designed infrastructure, I hope to learn more about solving the various problems involving performance bottlenecks in computational systems.",
    "problemsolving":"During my time researching quantum computing at UCLA, I learned how to apply my problem solving skills to a difficult, time-consuming research goal. Because neither my advisor nor my colleagues initially knew much about block encodings, I learned how to uncover the existing groundwork of research done for a particular subject. Furthermore, as I progressed in my research I learned how to be disciplined with my ideas. Some ideas for research did not generate satisfactory results initially, yet I learned to be patient and pursued my ideas diligently. Yet I also learned the wisdom of dropping a line of inquiry for the sake of \"doing\", gathering the results I could in the limited time frame I had.  As a result, I learned to solve a problem by properly researching existing work, seeking both new and old ideas for solutions, and finally evaluating the ideas critically with the end goal in mind.",
    "teamwork":"At my last internship at Rivos, I learned to effectively communicate and work with a team in the SDLC.  While my project was mostly orthogonal to my coworkers' work, meaning I was mostly designing and planning my software model on my own, I learned to effectively communicate every part of the development process with my manager, whether through Jira, meetings or just slack updates. I wrote multiple technical documents to communciate my design decisions, and used the documents as a basis for asking coworkers questions about microarchitecture or isa design. In this way, I was able to reach a common ground with regards to my projects goals and the existing acclerator design. Ultimately, I learned both the importance of well-thought communication with peers as well as the mobility of individual decision-making, both of which are necessary for working in a team.",
    "imageSource": "images/about/profile.png"
    
}